Repository: pingfangx/TranslatorX
Catalog: JetBrains/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Add Class...
zh_cn: 添加类...

source: Add Configuration Type
zh_cn: 添加配置类型

source: Add Copy of
zh_cn: 添加副本

source: Add Default Constructor
zh_cn: 添加默认构造函数

source: Add EJB interceptor
zh_cn: 添加 EJB 拦截器

source: Add Field Watchpoint
zh_cn: 添加字段观察点

source: Add Filter
zh_cn: 添加筛选器

source: Add Framework Support...
zh_cn: 添加框架的支持...

source: Add Frameworks Support
zh_cn: 添加框架支持

source: Add Group of Names
zh_cn: 添加组名称

source: Add Import
zh_cn: 添加导入

source: Add Instance Filter
zh_cn: 添加实例过滤器

source: Add IsNotNull Check Method
zh_cn: 添加 IsNotNull 检查方法

source: Add IsNull Check Method
zh_cn: 添加 IsNull 检查方法

source: Add Issue Navigation Link
zh_cn: 添加问题导航链接

source: Add JavaDoc URL...
zh_cn: 添加 JavaDoc URL ...

source: Add Live Template
zh_cn: 添加代码模板

source: Add Method
zh_cn: 添加方法

source: Add Method ''{0}'' to Blacklist...
zh_cn: 将方法 ''{0}'' 添加到黑名单...

source: Add Method ''{0}'' to Class ''{1}''
zh_cn: 添加方法 ''{0}'' 到类 ''{1}''

source: Add Module
zh_cn: 添加模块

source: Add New ''{0}'' Configuration
zh_cn: 添加新 ''{0}'' 配置

source: Add New Configuration
zh_cn: 添加新配置

source: Add New Favorites List
zh_cn: 添加到新收藏夹列表

source: Add New Keyword
zh_cn: 添加新关键字

source: Add New SDK
zh_cn: 添加新 SDK

source: Add New Scope
zh_cn: 添加新范围

source: Add On Demand Static Import
zh_cn: 按需添加静态导入

source: Add Package
zh_cn: 添加包

source: Add Path To JavaDoc
zh_cn: 添加到 JavaDoc 的路径

source: Add Pattern
zh_cn: 添加模式

source: Add Pattern...
zh_cn: 添加模式...

source: Add Poster Coords
zh_cn: 添加 Poster 坐标

source: Add Rectangular Selection on Mouse Drag
zh_cn: 拖动鼠标添加矩形选区

source: Add Replace Template...
zh_cn: 添加替换模板...

source: Add Replace template...
zh_cn: 添加替换模板...

source: Add Repository
zh_cn: 添加仓库

source: Add Runtime Exception to Method Signature
zh_cn: 将运行时异常添加到方法签名

source: Add Search Template...
zh_cn: 添加搜索模板...

source: Add Search template...
zh_cn: 添加搜索模板...

source: Add Selection for Next Occurrence
zh_cn: 将下一个匹配项添加到选择

source: Add Separator
zh_cn: 添加分隔符

source: Add Single-Member Static Import
zh_cn: 添加单个成员静态导入

source: Add To _New Favorites List
zh_cn: 添加到新收藏列表(_N)

source: Add TypeCast
zh_cn: 添加 TypeCast（类型转换）

source: Add VCS Directory Mapping
zh_cn: 添加 VCS 目录映射

source: Add Variable
zh_cn: 添加变量

source: Add Wildcard
zh_cn: 添加通配符

source: Add Xsi schema location for external resource
zh_cn: 为外部资源添加 Xsi 模式位置

source: Add _Content Root
zh_cn: 添加内容根目录(_C)

source: Add a new column to the table after the current one
zh_cn: 在表中当前列后添加一个新列

source: Add a new column to the table before the current one
zh_cn: 在表中当前列前添加一个新列

source: Add a space at comment start
zh_cn: 在注释开始时添加一个空格

source: Add an existing Ant build file to the list
zh_cn: 将现有的 Ant 构建文件添加到列表中

source: Add as Entry Point
zh_cn: 添加作为入口点

source: Add as Library...
zh_cn: 添加为库...

source: Add attribute value
zh_cn: 添加属性值

source: Add attribute/element
zh_cn: 添加属性/元素

source: Add closing tag
zh_cn: 添加关闭标签

source: Add constructor parameter
zh_cn: 添加构造函数参数

source: Add content root to the module
zh_cn: 将内容根目录添加到模块

source: Add dependency anyway?
zh_cn: 仍添加依赖？

source: Add dependency on module ''{0}''
zh_cn: 添加对模块 ''{0}'' 的依赖

source: Add dependency on module...
zh_cn: 添加对模块的依赖...

source: Add edit &point at the end of template
zh_cn: 在模板的结尾处添加编辑点(&P)

source: Add exception to catch clause
zh_cn: 添加异常的 catch 子句

source: Add exception to class constructors signature
zh_cn: 对类构造函数添加异常签名

source: Add exception to class {0, choice, 0#default constructor|1#constructor|2#constructors} signature
zh_cn: 添加异常到类的 {0, choice, 0#默认|1#|2#} 构造函数签名

source: Add exception to method signature
zh_cn: 添加异常到方法签名

source: Add explicit type arguments
zh_cn: 添加显式的类型参数

source: Add explicit type arguments to {0, choice, 1#1st|2#2nd|3#3rd|4#{0,number}th} argument
zh_cn: 将显式类型参数添加到第 {0,number} 个参数

source: Add file to {0}?
zh_cn: 将文件添加到 {0}？

source: Add files to {0}?
zh_cn: 将文件添加到 {0}？

source: Add generic parameters to the type
zh_cn: 向类型添加通用参数

source: Add import for ''{0}''
zh_cn: 为 ''{0}'' 添加导入

source: Add in &code
zh_cn: 添加代码(&C)

source: Add interceptor for EJB class ''{0}''
zh_cn: 为 EJB 类 ''{0}'' 添加拦截器

source: Add interceptor for business method ''{0}''
zh_cn: 为业务方法 ''{0}'' 添加拦截器

source: Add library ''{0}'' to classpath
zh_cn: 将库 ''{0}'' 添加到类路径中

source: Add library to classpath
zh_cn: 添加库到类路径

source: Add method body
zh_cn: 添加方法体

source: Add method qualifier
zh_cn: 添加方法限定符

source: Add missing Javadoc param tag
zh_cn: 添加缺少的 Javadoc 参数标签

source: Add missing Javadoc tag
zh_cn: 添加缺少的 Javadoc 标签

source: Add missing annotation parameter ''{0}''
zh_cn: 添加缺少的注解参数 ''{0}''

source: Add missing annotation parameters - {0}
zh_cn: 添加缺少的注解参数 - {0}

source: Add missing new expression
zh_cn: 添加缺失的 new 表达式

source: Add module dependency
zh_cn: 添加模块依赖

source: Add multiple carets on double {0} with arrow keys
zh_cn: 双击 {0} 并保持按住，使用方向键添加多个插入符号

source: Add new ...
zh_cn: 添加新的 ...

source: Add new arrangement rule
zh_cn: 添加新的排列规则

source: Add new module to the project
zh_cn: 向项目添加新模块

source: Add new renderer
zh_cn: 添加新的渲染器

source: Add new section arrangement rule
zh_cn: 添加新的部分排列规则

source: Add on demand static import for ''{0}''
zh_cn: 为 ''{0}'' 按需添加静态导入

source: Add or Remove Caret
zh_cn: 添加或移除插入符

source: Add parameters for &fields to constructors:
zh_cn: 为构造函数添加字段的参数：(&F)

source: Add parameters for &fields:
zh_cn: 为字段添加参数：(&F)

source: Add parentheses around method arguments
zh_cn: 添加方法参数的括号

source: Add path to external annotations
zh_cn: 添加外部注解的路径

source: Add property definition ''{0}''
zh_cn: 添加属性定义 ''{0}''

source: Add qualifier
zh_cn: 添加限定符

source: Add qualifier ''{0}'' to method
zh_cn: 将限定符 ''{0}'' 添加到方法

source: Add qualifier {0} to method
zh_cn: 将限定符 {0} 添加到方法

source: Add rule
zh_cn: 添加规则

source: Add runtime &assertions for not-null-annotated methods and parameters
zh_cn: 为非空注解方法和参数添加运行时断言(&A)

source: Add runtime exception(s) to method signature
zh_cn: 将运行时异常添加到方法签名

source: Add scope
zh_cn: 添加范围

source: Add section rule
zh_cn: 添加部分规则

source: Add selected element to migration roots
zh_cn: 添加选中元素到迁移根

source: Add selected node to favorites
zh_cn: 将选中节点添加到收藏

source: Add several cursors to your editor.
zh_cn: 向编辑器添加多个光标。

source: Add static import for ''{0}''
zh_cn: 为 ''{0}'' 添加静态导入

source: Add tag @param for parameter ''{0}''
zh_cn: 为参数 ''{0}'' 添加标签 @param

source: Add tag @{0} {1}
zh_cn: 添加标签 @{0}{1}

source: Add textual notes to the steps of a Cucumber scenario outline.
zh_cn: 将文本注释添加到 Cucumber 场景大纲的步骤中。

source: Add the next found occurrence to the selection by pressing &shortcut:SelectNextOccurrence;.
zh_cn: 按 &shortcut:SelectNextOccurrence; 将下一个匹配项添加到选择。

source: Add to Dependency Injection Annotations
zh_cn: 添加到依赖注入注解

source: Add to F_avorites
zh_cn: 添加到收藏(_A)

source: Add to Favorites
zh_cn: 添加到收藏

source: Add to Special Annotations
zh_cn: 添加到特殊的注解

source: Add to VCS
zh_cn: 添加到 VCS

source: Add to Watches
zh_cn: 添加到观察点

source: Add to watches
zh_cn: 添加到观察点

source: Add unambiguous imports on the fly
zh_cn: 快速添加清晰的导入

source: Add unversioned files
zh_cn: 添加受版本控制的文件

source: Add {0, choice, 0#exception|2#exceptions} to method signature
zh_cn: 添加异常到方法签名

source: Add {0} Support
zh_cn: 添加 {0} 支持

source: Add {0} no-args constructor to {1}
zh_cn: 将 {0} 无参构造函数添加到 {1}

source: Add {0} to custom html attributes
zh_cn: 添加 {0} 到自定义的 html 属性

source: Add {0} to custom html boolean attributes
zh_cn: 添加 {0} 到自定义 HTML 布尔属性

source: Add {0} to custom html tags
zh_cn: 添加 {0} 到自定义的 html 标签

source: Add {0} to custom tags
zh_cn: 将 {0} 添加到自定义标签

source: Add {0} to not required html attributes
zh_cn: 添加 {0} 到非必需的 html 属性

source: Add...
zh_cn: 添加...

source: Added
zh_cn: 添加的

source: Adding Dependency
zh_cn: 添加依赖关系

source: Adding Source Roots
zh_cn: 添加源码根目录

source: Adding dependency on module ''{0}'' will introduce circular dependency between modules ''{1}'' and ''{2}''.
zh_cn: 对模块 ''{0}'' 添加依赖将会引入模块 ''{1}'' 和 ''{2}'' 之间的循环依赖关系。

source: Adding parameter to a method
zh_cn: 增加参数到一个方法

source: Additional Classpath
zh_cn: 附加类路径

source: Additional Dependency Injection Annotations
zh_cn: 额外的依赖注入注解

source: Additional Javadoc Tags:
zh_cn: 额外的 Javadoc 标签：

source: Additional Not Required Html Attributes:
zh_cn: 额外的的非必需的 HTML 属性:

source: Additional Special Annotations
zh_cn: 额外的特殊注解

source: Additional command line parameters:
zh_cn: 附加命令行参数:

source: Additional entry points annotations
zh_cn: 额外的入口点注释

source: Additional settings
zh_cn: 附加设置

source: Additional shift:
zh_cn: 额外的偏移:

source: Additive operators (+, -)
zh_cn: 加法运算符 (+, -)

source: Adds current method to parameter name hints blacklist
zh_cn: 将当前方法添加到参数名称提示黑名单

source: Adjust Package Name
zh_cn: 调整包名

source: Adjust Range...
zh_cn: 调整范围...

source: Adjust automatic grouping of modules by changing the common prefix for their names
zh_cn: 通过更改名称的通用前缀来调整模块的自动分组

source: Adjust code style settings
zh_cn: 调整代码样式设置

source: Adjust colors for color vision deficiency
zh_cn: 为色觉缺陷调整颜色

source: Adjust colors for red-green vision deficiency (protanopia, deuteranopia)
zh_cn: 调整红、绿颜色视觉缺陷(红色盲，绿色盲)

source: Adjust method accepting functional expression
zh_cn: 调整方法接受函数表达式

source: Adjust module names if needed and press 'Convert' to rename modules and discard module groups.
zh_cn: 根据需要调整模块名称，然后按 '转换' 重命名模块并丢弃模块组。

source: Advanced
zh_cn: 高级

source: After ':'
zh_cn: 在 ':' 之后

source: After ':' in label declaration
zh_cn: 在标签声明 ':' 后

source: After '?'
zh_cn: 在 '?' 之后

source: After Compilation
zh_cn: 编译后

source: After anonymous class header:
zh_cn: 匿名类头部后:

source: After breakpoint was hit
zh_cn: 在断点触发后:

source: After breakpoint was hit:
zh_cn: 断点被命中后：

source: After class header:
zh_cn: 类头部后:

source: After comma
zh_cn: 逗号之后

source: After description
zh_cn: 在描述后

source: After disabling the plugin please restart {0} to apply changes in plugin configuration.
zh_cn: 禁用插件后,请重启 {0} 应用插件配置的更改。

source: After hit:
zh_cn: 命中后：

source: After imports:
zh_cn: 导入后:

source: After last field annotation
zh_cn: 最后一个字段注解后

source: After launch
zh_cn: 在启动后

source: After moving the lines down:
zh_cn: 向下移动行之后：

source: After moving the lines up:
zh_cn: 向上移动行之后：

source: After package statement:
zh_cn: 包语句后:

source: After parameter descriptions
zh_cn: 在参数描述后

source: After pressing '!':
zh_cn: 按 '!' 后：

source: After return tag
zh_cn: 在 return 后

source: After semicolon
zh_cn: 分号之后

source: After tag name
zh_cn: 在标签名后

source: After the code fragment that you want to change, type a dot (.), optionally press &shortcut:InsertLiveTemplate; and select the desired option.
zh_cn: 在想要改变的代码片断后面，输入一个点 (.)，可选地按下 &shortcut:InsertLiveTemplate; 然后选择所需的选项。

source: After type cast
zh_cn: 在类型转换之后

source: After {0}
zh_cn: 在 {0} 之后

source: Aliases:
zh_cn: 别名:

source: Align 'throws' to method start
zh_cn: 对齐 'throws' 到方法开始处

source: Align attributes
zh_cn: 对齐属性

source: Align consecutive variable declarations
zh_cn: 对齐连续的变量声明

source: Align fields in columns
zh_cn: 按列对齐字段

source: Align parameter descriptions
zh_cn: 对齐参数说明

source: Align parenthesised when multiline
zh_cn: 多行时对齐括号

source: Align simple methods in columns
zh_cn: 按列对齐简单方法

source: Align text
zh_cn: 对齐文本

source: Align thrown exception descriptions
zh_cn: 对齐抛出异常说明

source: Align variables in columns
zh_cn: 按列对齐变量

source: Align when multiline
zh_cn: 多行时对齐

source: Alignment
zh_cn: 对齐

source: All
zh_cn: 全部

source: All &projects
zh_cn: 所有项目(&P)

source: All Actions
zh_cn: 所有操作

source: All Changes Processed
zh_cn: 所有更改已处理

source: All Facets
zh_cn: 所有 Facets

source: All Project Classes
zh_cn: 所有项目类

source: All Tests
zh_cn: 所有的测试

source: All Tests Passed
zh_cn: 所有测试通过

source: All Tests Passed (except ignored)
zh_cn: 所有测试通过(除了被忽略的)

source: All Tests in Package
zh_cn: 包中的所有测试

source: All bundled plugins were uninstalled.
zh_cn: 所有捆绑的插件已卸载。

source: All candidate variables have types that are not in project
zh_cn: 所有候选变量都有不在项目中的类型

source: All candidate variables have unknown types
zh_cn: 所有的候选变量都是未知类型

source: All changes are synchronized with the original regular expression, and escapes are presented automatically.
zh_cn: 所有更改会与原始正则表达式同步，并自动显示转义。

source: All changes have been processed.
zh_cn: 所有更改已处理。

source: All changes have been processed.<br><a href="">Save changes and finish merging</a>
zh_cn: 已处理所有更改。<br><a href="">保存更改并完成合并</a>

source: All changes in module names will be recorded.
zh_cn: 模块名称中的所有更改都将被记录。

source: All changes will be moved to the active changelist.
zh_cn: 所有更改将被移动到活动更改列表。

source: All classes
zh_cn: 全部类

source: All classes are derived from java.lang.Object
zh_cn: 所有类都派生自 java.lang.Object

source: All conflicts resolved
zh_cn: 所有冲突已解决

source: All elements are null
zh_cn: 所有元素都是 null

source: All elements in range ({0}, {1}) are null
zh_cn: 所有元素在范围({0}, {1}) 都是 null

source: All escaped characters in the *.properties files in the format \uXXXX, are displayed in the resource bundle editor as un-escaped unicode literals.
zh_cn: *.properties 文件中 \uXXXX 格式的所有转义字符，在资源束编辑器中显示为未转义的 unicode 文字。

source: All file types
zh_cn: 所有文件类型

source: All files and subdirectories in "{0}" will be deleted.
zh_cn: "{0}" 中的所有文件和子目录将被删除。

source: All files and subdirectories in the selected directory(s) will be deleted.
zh_cn: 所选目录中的所有文件和子目录将被删除。

source: All files are up-to-date
zh_cn: 所有文件都是最新的

source: All files in &directory {0}
zh_cn: 目录 {0} 中的所有文件(&D)

source: All files in directory {0}
zh_cn: 目录 {0} 中的所有文件

source: All hunks have been processed.<br><a href="">Save changes and finish resolve</a>
zh_cn: 已处理所有块。<br><a href="">保存更改并完成解决</a>

source: All hunks resolved
zh_cn: 所有的区块已解决

source: All implementations of this method always return {0}
zh_cn: 此方法的所有实现始终都返回 {0}

source: All implementations of this method are empty
zh_cn: 此方法的所有实现都为空

source: All in &Package
zh_cn: 包中的全部(&P)

source: All in {0}
zh_cn: 所有在 {0}

source: All keymaps should have non empty names
zh_cn: 所有快捷键映射应该输入非空的名称

source: All keymaps should have unique names
zh_cn: 所有快捷键映射应该使用唯一的名称

source: All listed
zh_cn: 所有列出的

source: All of the changes in the specified patch are already contained in the code
zh_cn: 该补丁的所有更改已包含于代码中

source: All path variables should be defined
zh_cn: 应定义所有路径变量

source: All reference type parameters have types that are not in project
zh_cn: 所有引用类型参数都有不在项目中的类型

source: All reference type parameters have unknown types
zh_cn: 所有的引用类型参数都是未知类型

source: All texts, including comments, textual strings and literals, are inspected against the pre-defined dictionaries.
zh_cn: 所有文本，包括注释，文本字符串和文字字面量，都会根据预定义的字典进行检查。

source: All the encountered occurrences of a search string are highlighted, while the selection is in different color.
zh_cn: 搜索字符串的所有匹配项高亮显示，而选择是不同的颜色。

source: All the words from the current file that start with the typed prefix will appear in the lookup list.
zh_cn: 来自当前文件的所有以键入的前缀开头的单词将显示在查阅列表中。

source: All these directories will be moved, and all references to {0} will be changed.
zh_cn: 所有这些目录将被移动，对 {0} 的所有引用 将会改变。

source: All typos are highlighted, which leaves you with the task of choosing the correct word, accepting the current spelling, or disabling inspection.
zh_cn: 所有错别字都会被高亮显示，使您可以选择正确的单词，接受当前的拼写或禁用检查。

source: All you have to do is to define issue navigation patterns in the Settings | Version Control | Issue Navigation dialog:
zh_cn: 所有你所需要做的就是在 Settings | Version Control | Issue Navigation 对话框中定义问题导航模式：

source: All you have to do is to define issue navigation patterns in the Settings | Version Control dialog:
zh_cn: 所有你所需要做的就是在 Settings | Version Control 对话框中定义问题导航模式：

source: All you have to do is to define issue navigation patterns on the Version Control page of the Settings/Preferences dialog:
zh_cn: 所有你所需要做的就是在 Settings/Preferences 对话框中的 Version Control 页中定义问题导航模式：

source: All you have to do is to point to the directories where your dictionaries are stored, in the Spelling of the Settings dialog.
zh_cn: 你只需要在 Settings 对话框的 Spelling 指向你的字典存储目录即可。

source: All you have to do is to point to the directories where your dictionaries are stored, in the Spelling page of the Editor Settings/Preferences.
zh_cn: 你只需要在 Settings 对话框的 Spelling 页指向你的字典存储目录即可。

source: All your most indispensable VCS commands are just one-click away...
zh_cn: 只需一键即可使用你常用的所有 VCS 命令...

source: All {0} usages in {1} are in this line
zh_cn: 所有在 {1} 中的 {0} 使用,都在这一行

source: Allocated heap size: {0}M Used: {1}M
zh_cn: 分配堆大小: {0}M 已使用: {1}M

source: Allow Line Numbers
zh_cn: 允许显示行号

source: Allow Status Bar
zh_cn: 允许显示状态栏

source: Allow VCS Annotations
zh_cn: 允许显示 VCS 注释

source: Allow placement of caret after end of line
zh_cn: 允许放置插入符号在行尾

source: Allow placement of caret inside tabs
zh_cn: 允许插入符号放置在 tab 内

source: Allow sending usage statistics to {0}
zh_cn: 允许发送使用统计数据到 {0}

source: Allow usages of
zh_cn: 允许被...使用

source: Allow usages of scope ''{0}'' in scope ''{1}''
zh_cn: 在范围 ''{1}'' 启用范围 ''{0}'' 的使用

source: Allows to choose a Java version to start the IDE with.
zh_cn: 允许选择 Java 版本来启动 IDE。

source: Allows to provide more information to the support team by request.
zh_cn: 允许通过请求向支持团队提供更多信息。

source: Alphabetical order for tabs is ON.
zh_cn: 选项卡按字母顺序排序是打开的。

source: Already assigned to:
zh_cn: 已经分配给:

source: Also they are available to all projects create locally on your computer.<br><br>Note that Global libraries are not available to anybody you share your project with.
zh_cn: 此外，它们可用于在您的计算机上本地创建的所有项目。<br><br>请注意，全局库不可用于与您共享项目的任何人。

source: Also they are available to everybody you share the project with.<br><br>Expand the node and select child items to manage Project libraries.<br><br> To attach a library to a module, select that module, click the Dependencies tab, click Add and specify the library location.
zh_cn: 此外，它们可以与您共享项目的每个人一起使用。<br><br>展开节点并选择子项目以管理项目库。<br><br>要将库附加到模块，请选择该模块，单击依赖关系选项卡，单击添加并指定库位置。

source: Also, HTML tags inside selection must be balanced.
zh_cn: 此外，选择内的 HTML 标签必须平衡。

source: Alternative JRE path needs to point to a JRE, not to a complete JDK installation
zh_cn: 可选的 JRE 路径需要指向一个 JRE，而不是一个完整的 JDK 安装

source: Alternative source available for the class {0}
zh_cn: 类 {0} 可用的备选的源码

source: Always
zh_cn: 总是

source: Always keep trailing spaces on caret line
zh_cn: 始终保持插入符号行的尾随空格

source: Ambiguous method call: both ''{0}'' and ''{1}'' match
zh_cn: 模棱两可的方法调用:''{0}'' 和 ''{1}'' 都匹配

source: Ambiguous module reference: {0}
zh_cn: 模糊的模块引用：{0}

source: An SDK is required for compiling, debugging and running applications, as well as for the standard SDK classes resolution.
zh_cn: 编译，调试和运行应用程序需要一个 SDK， 标准的 SDK 类解析也需要。

source: An archive of a few kilobytes will be sent weekly.
zh_cn: 每周将发送几 KB 的存档。

source: An attempt was made to load a program with an incorrect format.
zh_cn: 试图使用不正确的格式加载程序。

source: An enum switch case label must be the unqualified name of an enumeration constant
zh_cn: 枚举 switch 的 case 标签必须是枚举常量的合格名称

source: An error occurred while popping stack frame: {0}
zh_cn: 弹出桢时发生错误：{0}

source: An expression can not be replaced with a non-expression
zh_cn: 表达式不能用非表达式替换

source: An intention action feature will suggest you to automatically create the necessary tag, without the need for you to leave your current editing location.
zh_cn: 意图操作功能将建议您自动创建必需的标签，而无需离开当前的编辑位置。

source: Analy_ze
zh_cn: 分析(_Z)

source: Analysing Dependencies
zh_cn: 分析依赖关系

source: Analysing font: {0}
zh_cn: 分析字体:{0}

source: Analysis
zh_cn: 分析

source: Analysis Actions
zh_cn: 分析操作

source: Analysis completed
zh_cn: 分析完成

source: Analysis scope
zh_cn: 分析范围

source: Analyze
zh_cn: 分析

source: Analyze Data Flow _from Here
zh_cn: 分析流出这里的数据(_F)

source: Analyze Data Flow _to Here
zh_cn: 分析流入这里的数据(_T)

source: Analyze Java Menu
zh_cn: 分析 Java 菜单

source: Analyze Stacktrace
zh_cn: 分析堆栈跟踪

source: Analyze _Backward Dependencies...
zh_cn: 分析反向依赖...(_B)

source: Analyze _Cyclic Dependencies...
zh_cn: 分析循环依赖关系...(_C)

source: Analyze _Dependencies...
zh_cn: 分析依赖...(_D)

source: Analyze _Module Dependencies...
zh_cn: 分析模块依赖...(_M)

source: Analyze _Stacktrace...
zh_cn: 分析堆栈跟踪...(_S)

source: Analyze and Replace Usages
zh_cn: 分析和替换使用

source: Analyzing Backward Dependencies
zh_cn: 分析反向依赖

source: Analyzing Dependencies
zh_cn: 分析依赖

source: Analyzing Fonts
zh_cn: 分析字体

source: Analyzing Project
zh_cn: 分析项目

source: Analyzing code ...
zh_cn: 分析代码 ...

source: Analyzing code in
zh_cn: 分析代码于

source: Analyzing non-code usages...
zh_cn: 分析代码无关的用法...

source: Analyzing package dependencies
zh_cn: 分析包依赖

source: Anchor reference problems
zh_cn: 锚点引用问题

source: Animate windows
zh_cn: 窗口动画

source: Animation disabled
zh_cn: 动画禁用

source: Annotate
zh_cn: 注释

source: Annotate &field as @NonNls
zh_cn: 注解字段为 @NonNls(&F)

source: Annotate as @{0}
zh_cn: 注解为 @{0}

source: Annotate file
zh_cn: 注释文件

source: Annotate method
zh_cn: 注解方法

source: Annotate method as ''@{0}''
zh_cn: 注释方法为 ''@{0}''

source: Annotate overridden method parameters
zh_cn: 注解重写方法参数

source: Annotate overridden method parameters as ''@{0}''
zh_cn: 将得写方法的参数注解为 ''@ {0}''

source: Annotate overridden methods
zh_cn: 注解重写的方法

source: Annotate overridden methods and self
zh_cn: 注解重写的方法及自己

source: Annotate overridden methods as ''@{0}''
zh_cn: 注解覆盖方法为 ''@{0}''

source: Annotate the base method as well?
zh_cn: 注解基础方法吗？

source: Annotate {0} ''{1}'' as @{2}
zh_cn: 注解 {0} ''{1}'' 为 @{2}

source: Annotate {0} ''{1}''...
zh_cn: 注解 {0} ''{1}''...

source: Annotate...
zh_cn: 注解...

source: Annotation
zh_cn: 注解

source: Annotation Class
zh_cn: 注解类

source: Annotation array initializer left brace
zh_cn: 注解数组初始化左大括号

source: Annotation attribute must be of the form 'name=value'
zh_cn: 注解属性必须为 'name = value'

source: Annotation not applicable to this kind of reference
zh_cn: 注解不适用于此类引用

source: Annotation parameters
zh_cn: 注解参数

source: Annotation parentheses
zh_cn: 注解括号

source: Annotation type expected
zh_cn: 预期注解类型

source: Annotations
zh_cn: 注解

source: Annotations are not allowed here
zh_cn: 这里不允许使用注解

source: Annotations//Annotation attribute name
zh_cn: 注解//注解属性名称

source: Annotations//Annotation name
zh_cn: 注解//注释名

source: Anonymize &Fields
zh_cn: 匿名字段(&F)

source: Anonymize &Functions
zh_cn: 匿名函数(&F)

source: Anonymize &Literals
zh_cn: 匿名文字(&L)

source: Anonymize &Methods
zh_cn: 匿名方法(&M)

source: Anonymize &Types
zh_cn: 匿名类型(&T)

source: Anonymize &Variables
zh_cn: 匿名变量(&V)

source: Anonymize Local &Variables
zh_cn: 匿名局部变量(&V)

source: Anonymize uncommon subexpressions simpler than
zh_cn: 比...更简单的匿名不常见的子表达式

source: Anonymous Class
zh_cn: 匿名类

source: Anonymous class
zh_cn: 匿名类

source: Anonymous class context is not reachable.
zh_cn: 无法访问匿名类上下文。

source: Anonymous class declaration context is not reachable from entry points.
zh_cn: 匿名类声明上下文不能从入口点访问。

source: Anonymous class derived from {0}
zh_cn: 派生自 {0} 的匿名类

source: Anonymous class evaluation is not supported
zh_cn: 不支持匿名类解析

source: Anonymous in {0}
zh_cn: {0} 中的匿名

source: Another variable ''{0}'' definition is used together with inlined one
zh_cn: 另一个变量 ''{0}'' 定义与内联一起使用

source: Another way to accept suggestions is by pressing !.
zh_cn: 接受建议的另一种方法是按 !。

source: Another way to reopen a project is to right-click the &productName; icon on the task bar:
zh_cn: 重新打开一个项目的方式是在任务栏右击 &productName; ：

source: Another way to reopen a project is to right-click the PhpStorm icon on the task bar:
zh_cn: 重新打开一个项目的方式是在任务栏右击 &productName; 图标：

source: Another way to reopen a project is to right-click the WebStorm icon on the task bar:
zh_cn: 重新打开一个项目的方式是在任务栏右击 &productName; 图标：

source: Ant ''{0}'' is not configured
zh_cn: Ant ''{0}'' 未配置

source: Ant Build Input
zh_cn: Ant 构建输入

source: Ant Build Progress
zh_cn: Ant 构建进度

source: Ant Command Line
zh_cn: Ant 命令行

source: Ant Process is active.
zh_cn: Ant 进程处于活动状态。

source: Ant Setup
zh_cn: Ant 设置

source: Ant Targets
zh_cn: Ant 目标

source: Ant build aborted in {0} at {1}
zh_cn: Ant 构建中止在 {0} {1}

source: Ant build completed successfully in {0} at {1}
zh_cn: Ant 构建成功完成在 {0} {1}
